# Задайте последовательность чисел. Напишите программу,
# которая выведет список неповторяющихся элементов исходной последовательности.

from random import randint
spisok = [1,1,2,2,3,3,5,5]
print(set(spisok))